[
  {
    "Id": "904307",
    "ThreadId": "393148",
    "Html": "\r\n<p>We currently use EDIFECs to validate the X12 files and then, if valid, split claims into their individual XML files. &nbsp;This is a pretty expensive solution so I was considering switching to this tool to save a few dollars. &nbsp;It appears that this code\r\n base would easily fit those needs. &nbsp;I was worried about the statement on the front page saying &quot;<span>The built-in specs and transformations are not meant to be complete, only provide the most common data elements&quot;.<br>\r\n</span></p>\r\n<p><span>Does this just mean that I may need to modify the &nbsp;837 specification files? &nbsp;Are there any other gotchas out there that I should be aware of?<br>\r\n<br>\r\nThanks for your help.&nbsp;</span></p>\r\n",
    "PostedDate": "2012-08-26T17:06:06.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "904336",
    "ThreadId": "393148",
    "Html": "<p>I am working on finishing up some validation methods as a part of discussion&nbsp;<a href=\"http://x12parser.codeplex.com/discussions/390657\">http://x12parser.codeplex.com/discussions/390657</a>.</p>\r\n<p>I will probably update soon with a more concise specification for the 5010 837D and 837P. &nbsp;THe 837I is checked in, but has not yet been released.</p>\r\n<p>What has been released is focused more on the ability to parse. &nbsp;Occassionally creators of EDI choose to add things that aren't part of the spec. &nbsp;I have also noticed in creating unit tests, that sometimes the sample EDI that is provided doesn't always conform to the specification document in which it is placed. &nbsp;So to accommodate this some of the specs add more than what is in any official specification.</p>\r\n<p>The disclaimer on the website is more to address that outside of the HIPAA set of transactions are tightly controlled by WPC, most of the other transactions were created by randomly sampling 2 to 5 implementation guides across the internet. &nbsp;This doesn't always guarantee completeness, but they were tested against what examples I were able to find of each transaction set.</p>\r\n<p>The included specifications are included as is with no guarantee of correctness. &nbsp;You should know what you are expecting from your trading partners and review yourself to determine if you need to override with your own by seeing this&nbsp;<a href=\"http://x12parser.codeplex.com/wikipage?title=Injecting%20your%20own%20X12%20Specification\">http://x12parser.codeplex.com/wikipage?title=Injecting%20your%20own%20X12%20Specification</a>. &nbsp;You might choose to use a tighter specification for your validation and acknowledgment.</p>\r\n<p>The other interesting thing about the 837, is that it is difficult to determine if you are working with the D, P or I version until you have actually parsed the transaction beyond just the ST segment. &nbsp;Unfortunately they are inconsistent in the identification of Loops based on an NM1's entity identifier code.</p>\r\n<p>For instance, the 2310B loop is a rendering provider in the 837P, but in a 837I the same loop ID is an Operating Physician. &nbsp;For this reason the default spec uses the LoopId's from the 837P spec first, and then attempts to add the additional loops so the document is also parsable for the 837I and the 837P. &nbsp;When you know ahead that you are parsing an 837I or 837P, you just need to inject a different SpecificationFinder if you want you xml to 100% correct to each specification.</p>\r\n<p>I am going to address this issue better in the next release, hopefully no more than 2 weeks from today.</p>\r\n<p>I hope you did also see that there is an Unbundling feature that will handling splitting claims that you mentioned you will need. &nbsp;See here:&nbsp;<a href=\"http://x12parser.codeplex.com/wikipage?title=Unbundling%20an%20X12%20file%20by%20Loop%20ID\">http://x12parser.codeplex.com/wikipage?title=Unbundling%20an%20X12%20file%20by%20Loop%20ID</a></p>",
    "PostedDate": "2012-08-26T19:46:48.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]