[
  {
    "Id": "1068245",
    "ThreadId": "449994",
    "Html": "Hi.\r<br />\n<br />\nI have parsed Interchange object to get Segment values.Its working fine.\r<br />\n<br />\nI want to update(inject) the Data into segment like patient Name. How to inject value into Interchange object.<br />\n\r<br />\nThanks\r<br />\nDesigank<br />\n",
    "PostedDate": "2013-07-15T00:39:28.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1070231",
    "ThreadId": "449994",
    "Html": "You need to first grab the segment that contains the element for the patient name. <br />\n<br />\nSo as you know each <strong>interchange</strong> can contain 1 or more <strong>functional groups</strong> and each functional group can contain 1 or more <strong>transactions</strong><br />\n<br />\nSo the first step for you will be getting down to the transaction level because this is your actual document (855, 990 ect) the rest is more or less just the envelope your information will be sent inside.<br />\n<br />\nFor the sake of this sample i'm just going to assume there is 1 interchange, 1 functional group and 1 transaction.<br />\n<br />\nOur first step is again to get down to the transaction. <br />\n<pre><code>            var tran = interchange.FunctionGroups.First().Transactions.First();</code></pre>\n\nNow that we have our transaction we need to get the <strong>segment</strong> that contains the <strong>element</strong> we want to modify.<br />\n<br />\nTo find your segment you need to make sure you understand the spec you are working with. To get the segment you need to understand where it really is in the document (is it inside of a loop you will need to find first ect). I will provide the most basic example of getting a segment called &quot;IT1&quot;<br />\n<pre><code>var segment = transaction.Segments.FirstOrDefault(o =&gt; o.SegmentId == &quot;IT1&quot;);</code></pre>\n\nNow we are finally able to modify our segment. I will modify the first element in this segment to hold &quot;myvalue&quot;.<br />\n<pre><code>segment.SetElement(1,&quot;myvalue&quot;);</code></pre>\n\n",
    "PostedDate": "2013-07-18T15:41:29.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1072666",
    "ThreadId": "449994",
    "Html": "Hi Thanks for your response.  I have another Doubt regarding Add new &quot;K3&quot; segment to pass the information to client in 837 file. I tried to add the segment. but its added in last position in the Segments. How to add the K3 segment in between REF and NTE. Could you please assit me to update the K3 in Exact position.\r<br />\n<br />\nThanks,\r<br />\nGnanadesigan k<br />\n",
    "PostedDate": "2013-07-25T02:30:40.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1074423",
    "ThreadId": "449994",
    "Html": "You should be able to do this by modifying the Ansi-*-4010Specification.xml file and just ordering them. Obviously a child segment inside of a loop should remain in that loop or you could have all kinds of other issues.<br />\n<br />\n**PS the placement of this segment should really not matter to you or any other standard translator except for possibly the preference of you manually reading the EDI.<br />\n",
    "PostedDate": "2013-07-29T11:44:30.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]