[
  {
    "Id": "1126553",
    "ThreadId": "470452",
    "Html": "One of the folks that send a large amount of claims data to us has about a 1% Hierarchical Loop Failure on their files. They have researched the error, and since the Insurance companies and clearinghouses that they send the data to accept the data, they have no intention to modify their program.\r<br />\n<br />\nWe have little recourse but to accept their data as is, and make use of it. If I set the flag that turns these errors into warning messages, will these files be imported into my database, or will they just be ignored silently?\r<br />\n<br />\nMy preference is to accept the data, as I do not believe that these errors would cause us a problem.<br />\n",
    "PostedDate": "2013-11-19T07:16:16.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1127534",
    "ThreadId": "470452",
    "Html": "I asked if they had checked with the developers about the Hierarchical Loop issue and their responses was;\r<br />\n<br />\n&quot;I checked with GE in regards to the way their EDI Plugin builds the file and verified that relay health isn't reporting issues. GE didn't go into the why it is built in that order but supplied a list of all known reported issues and upcoming service pack releases - there aren't any indications of HL issues or upcoming updates.<br />\n\r<br />\nThis same EDI creator is used for Emdeon, Availity, and the Centricity Clearinghouse so I would say that while the HL1 is a significant value - the additional HL2+ segments are either correct (the ANSI guidelines are complex to interpret) or the segments are wrong but the clearinghouses/carriers aren't enforcing them. &quot;\r<br />\n<br />\nThis seems to confirm that it will not be changed on their side.<br />\n",
    "PostedDate": "2013-11-21T06:05:41.987-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1134299",
    "ThreadId": "470452",
    "Html": "So the consumer of these files are either not able to consume these segments, but their applications ignore it and no cares or the do some kind of partial parse with the HLs that are present.  This is highly unlikely that they can pay a claim with a missing HL loop since you need to know the patient and the payer to complete that transaction.\r<br />\n<br />\nThe only possible feature change I could make is if the HL parent segment exists after the reference to it.\r<br />\nI have always assumed that the HL ids are sequential and that parent segments appear before it, but the spec doesn't really require this.  It's just usually the easiest way to implement it.\r<br />\n<br />\nIf you can find a file that is throwing this error, and give me the sequence of just the HL segments (this will allow me to see which HL it is (provider, subscriber, patient) and where are they attempting to reference each other, I can determine if a feature change will fix this.\r<br />\n<br />\nIf the file is just pointing to HL segments that don't exist in the transaction then I can't help you and your best bet is to turn on the flag that will treat it as a warning and not an exception.<br />\n",
    "PostedDate": "2013-12-11T07:33:29.293-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1134680",
    "ThreadId": "470452",
    "Html": "<span style=\"font-family:Tahoma,Geneva,sans-serif; font-size:10pt\">Dannie:\r\n<div><br>\r\n</div>\r\n<div>You have signed an HIPPA form to look at this data. I could send you a file with the error, and the error it generates, encrypted. Would that work for you?<br>\r\n<br>\r\n<div>\r\n<p>Paul R. Stearns<br>\r\nAdvanced Consulting Enterprises, Inc.<br>\r\n14411 Commerce Way<br>\r\nSuite 220<br>\r\nMiami Lakes, Fl 33016<br>\r\n<br>\r\n</p>\r\n<p>Voice: (305)623-0360 x107<br>\r\nFax: (305)623-4588</p>\r\n</div>\r\n<br>\r\n<br>\r\n<span style=\"font-family:tahoma,arial,sans-serif; font-size:10pt\">\r\n<hr size=\"2\" width=\"100%\" align=\"center\">\r\n<b>From</b>: &quot;dstrubhar&quot; &lt;[email removed]&gt;<br>\r\n<b>Sent</b>: Wednesday, December 11, 2013 10:34 AM<br>\r\n<b>To</b>: [email removed]<br>\r\n<b>Subject</b>: Re: Hierarchical Loop failures [x12parser:470452]</span><br>\r\n<br>\r\n<p>From: dstrubhar</p>\r\n<div id=\"ThreadNotificationPostBody\">So the consumer of these files are either not able to consume these segments, but their applications ignore it and no cares or the do some kind of partial parse with the HLs that are present. This is highly unlikely that\r\n they can pay a claim with a missing HL loop since you need to know the patient and the payer to complete that transaction.\r\n<br>\r\n<br>\r\nThe only possible feature change I could make is if the HL parent segment exists after the reference to it.\r\n<br>\r\nI have always assumed that the HL ids are sequential and that parent segments appear before it, but the spec doesn't really require this. It's just usually the easiest way to implement it.\r\n<br>\r\n<br>\r\nIf you can find a file that is throwing this error, and give me the sequence of just the HL segments (this will allow me to see which HL it is (provider, subscriber, patient) and where are they attempting to reference each other, I can determine if a feature\r\n change will fix this. <br>\r\n<br>\r\nIf the file is just pointing to HL segments that don't exist in the transaction then I can't help you and your best bet is to turn on the flag that will treat it as a warning and not an exception.<br>\r\n</div>\r\n<br>\r\n</div>\r\n</span>",
    "PostedDate": "2013-12-11T15:28:26.127-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]